[
  {
    "path": "posts/2021-08-15-poster/",
    "title": "Poster",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Yu Yaxin <br>Li Yuhong <br>Xu Dan",
        "url": {}
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nThe link of poster is available here.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T22:09:50+08:00",
    "input_file": "poster.knit.md"
  },
  {
    "path": "posts/2021-08-10-application-and-user-guide/",
    "title": "Application and User Guide",
    "description": "For Shiny Application created by G1 - Team 13",
    "author": [
      {
        "name": "Yu Yaxin <br>Li Yuhong <br>Xu Dan",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nApplication User Guide\r\n1 Interface design\r\n1.1 For Navigation Bar\r\n1.2 For Side Panel\r\n1.3 For Main Panel\r\n\r\n2 Introduction to main pages\r\n2.1 Home\r\n2.2 Background Analysis\r\nPopular Locations\r\nHotpoints of News Articles\r\n\r\n2.3 Consumption Analysis\r\nConsumption Comparison\r\nConsumption of Each Location\r\n\r\n2.4 Path Visualization\r\n\r\n\r\nApplication User Guide\r\n1 Interface design\r\nThe interface mainly about three parts. 插入图片\r\n1.1 For Navigation Bar\r\nThe top navigation bar has 5 main sections with drop-down selections:\r\ni. Home\r\nii. Background Analysis\r\n+ Popular Locations\r\n+ Hotpoints of News Articles\r\nii. Consumption Analysis\r\n+ Consumption Comparison\r\n+ Consumption of Each Location\r\niii. Path Visualization\r\niv. Relationship\r\n1.2 For Side Panel\r\nThe side panel provides users with variable toggling parameters that can filter the main panel. Users can determine the visualization format of the main panel according to the parameters.\r\n1.3 For Main Panel\r\nThe main panel is where the visualization will be shown.\r\n2 Introduction to main pages\r\n2.1 Home\r\nThe home page mainly introduces the general situation of GASTech company, the background of the story and the purpose of this application.\r\n2.2 Background Analysis\r\nThe background analysis mainly includes two parts: one is to find the most popular location among GASTech employees by screening different payment methods; One is to find the most frequently occurring words in news articles in the past two decades.\r\nPopular Locations\r\n插入图片\r\nThe popular locations provides an overall view of how often each location is consumed by GASTech employees within two weeks. Users can choose different payment methods - credit card consumption and loyalty card consumption to distinguish the occurrence times of different locations.\r\nAnd also this graph is interactive since users can see detailed numbers of each location’s frequency.\r\nHotpoints of News Articles\r\n插入图片\r\nThis interface uses two kinds of visualizing methods - bar chart and word cloud, mainly displays the news information in recent 20 years. By selecting the news of different newspapers, you can find out which words appear most frequently.\r\nThe first control panel is used for users to filter different newspapers. The second control panel can change the minimum standard of word frequency in bar chart. The third panel can control the maximum number of words in word cloud.\r\n2.3 Consumption Analysis\r\nConsumption analysis mainly adds the change of time to find the most popular places for GASTech employees on different dates and time periods.\r\nConsumption Comparison\r\n插入图片\r\nUsers can filter out the places with the highest heat according to different times and dates.\r\nConsumption of Each Location\r\n插入图片 Users can select different locations to observe which is consumed the most times on different dates and time periods, so as to obtain the insights of consumption preferences of GASTech employees.\r\n2.4 Path Visualization\r\n插入图片\r\nAfter manipulating GPS data, it can be used to visualize the walking path of each employee in weekdays, and obtain the employee’s personal information through unique car ids and present it on the data table.\r\nEach car ID represents an employee. Users can select different car IDs to filter the employee paths they want to observe. In the second control panel, you can select different days of the week, and the path of employees in the main panel will change accordingly, so as to find suspicious behaviors of employees.\r\nAnd also, can change the contents in the data table by selecting different car IDs. The data table will tell the user the employee’s detailed information, about names, department and position corresponding to this car ID.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T23:04:28+08:00",
    "input_file": "application-and-user-guide.knit.md"
  },
  {
    "path": "posts/2021-06-21-proposal/",
    "title": "Proposal",
    "description": "This is the proposal of the project.",
    "author": [
      {
        "name": "G1-Group13",
        "url": {}
      }
    ],
    "date": "2021-06-21",
    "categories": [],
    "contents": "\r\n1. Motivation1\r\nMovement data in space and time provide critical information about the behavior of objects studied, i.e., vehicles, humans, and animals. Insights from spatial and temporal movements drive many human and ecological studies. These studies enable in-depth analysis and understanding of complex processes like human migration, forest fires and natural disasters as well as mobility and transportation.\r\nA person’s life and consumption path can provide abundant information for us. As GPS data are becoming increasingly prevalent as locational information in movement studies, we can identify the most probable route from a set of GPS pedestrian trajectories and consumption information. We can further demonstrate the relationship between uncertainty in individual GPS measurements at different scales and how these affect the fine-scale movement descriptions.\r\n2. Problems Introduction\r\nIdentify the complex relationships among all of these people and organizations.\r\nIdentify anomalies and suspicious behaviors.\r\nIdentify which people use which credit and loyalty cards.\r\n3. Related Work\r\nTry to figure out the tracks of all the employees based on the GPS tracking of cars and loyalty cards, and then compare the GPS track with the location of celebration. Map the tracks of employee in the map provided, and the map will show the tracks and locations of consumption dynamically. At the same time, by using the unique loyalty number, unique card number and tracks we can identify which people use which credit and loyalty cards.\r\nPlot the consumption of employees, and then find out the suspicious behaviors, like extremely high consumption, repeated consumption in some special locations or make some consumptions nearby the location of celebration on the date of celebration.\r\nMake the employees’ relationship net based on the GPS information. We may see some people will have similar tracks in some dates, and then we can get that they will have more intimate relationships. If a person appears in one location repeatedly, he or she may have potential relationship with this organization.\r\n4. Approach\r\nUse R to clean and tidy data: clean missing values and combine some dataset for further analysis. The package of R used will be tidyr and dplyr.\r\nVisualisation: two kinds of graphs will be plotted. The first one is path diagram which is aim to plot the living and working track of each employee. The another one is relationship net graph. According to these two graphs we will summarize special information for readers.\r\nR shiny: make an application that can see the current employment information, GPS tracks, consumption information and relationship net of each employee. In this application, any suspicious behaviors or special locations will be highlighted.\r\nText analysis: By using the dataset from other challenges, we will analyze the resumes of employees in Challenge 1.\r\nBuild the GitHub Link and Website.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T20:37:09+08:00",
    "input_file": {}
  }
]
